v2206/atmospheric_AloisLuggerPlatz/meshTest/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;
// addLayers       on;

geometry
{
    buildings_with_streets_simplified
    {
        type triSurfaceMesh;
        file "buildings_with_streets_simplified_test.obj";
        #include "snappyRegionsDict"
    }

    refinementChannel
    {
        type searchableBox;
        min  (-300   0  -220);
        max  ( 150  75   130);
    }

    refinementBox
    {
        type searchableBox;
        min  (-200   0  -205);
        max  (  80  65   110);
        // max  (  80  60   110);
    }
};

castellatedMeshControls
{
    minRefinementCells 0;
    nCellsBetweenLevels 2;

    features
    (
        { 
            file "buildings_with_streets_simplified_test.eMesh";
            level 5;
        }
    );


    refinementSurfaces
    {
        buildings_with_streets_simplified
        {
            level (6 6);
            patchInfo { type wall; }
            // regions
            // {
            //     grass
            //     {
            //         level (3 3);
            //         patchInfo { type wall; }
            //     }
            // }
        }
    }

    refinementRegions
    {
        refinementChannel
        {
            mode inside;
            levels ((1E15 2));
        }

        refinementBox
        {
            mode inside;
            levels ((1E15 3));
        }

        // #include "snappyRegionsRefineDict"

        // buildings_grass_off
        // {
        //     mode distance;
        //     levels ((3.0 4));  
        //     // #include "snappyRegionsRefineDict"
        //     // regions
        //     // {
        //     //     walls_top
        //     //     {
        //     //         mode distance;
        //     //         levels ((4.0 4));  
        //     //     }

        //     //     walls_ground
        //     //     {
        //     //         mode distance;
        //     //         levels ((4.0 4));  
        //     //     }

        //     //     walls_east
        //     //     {
        //     //         mode distance;
        //     //         levels ((4.0 4));  
        //     //     }

        //     //     walls_west
        //     //     {
        //     //         mode distance;
        //     //         levels ((4.0 4));  
        //     //     }

        //     //     walls_north
        //     //     {
        //     //         mode distance;
        //     //         levels ((4.0 4));  
        //     //     }

        //     //     walls_south
        //     //     {
        //     //         mode distance;
        //     //         levels ((4.0 4));  
        //     //     }
        //     // }
        // }
    }

    // locationInMesh (1 1 70);
    locationInMesh (1 1 30);

    // resolveFeatureAngle 30;
    resolveFeatureAngle 10;
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch    10;
    tolerance       4.0;
    nSolveIter      40;
    nRelaxIter      10;

    nFeatureSnapIter 10;

    implicitFeatureSnap    false;
    explicitFeatureSnap    true;
    multiRegionFeatureSnap true;

    // implicitFeatureSnap    true;
    // explicitFeatureSnap    false;
    // multiRegionFeatureSnap false;
}

addLayersControls
{
    layers
    {
        buildings_with_streets_simplified
        {
            nSurfaceLayers 2;
        }
    }

    // relativeSizes       false;
    // expansionRatio      1.2;
    // firstLayerThickness 0.5;
    // minThickness        1e-3;

    relativeSizes       true;
    expansionRatio      1.2;
    // finalLayerThickness 0.8;
    firstLayerThickness 0.5;
    minThickness        1e-3;
    
    nGrow 0;
    // featureAngle 15;
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 8;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    nBufferCellsNoExtrude 0;
    nLayerIter 10;
    
    // maxFaceThicknessRatio 0.5;
    // maxThicknessToMedialRatio 0.3;
    // minMedianAxisAngle 90;

    maxFaceThicknessRatio 1.0;
    maxThicknessToMedialRatio 0.2;
    minMedianAxisAngle 90;    
}

meshQualityControls
{}

writeFlags
(
    noRefinement
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
