v2206/atmospheric_AloisLuggerPlatz/meshTest/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// buildings_with_streets.obj { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        no;
//         openEdges               no;
//     }
// }

buildings_with_streets_simplified_test.obj { 
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 150; }

    subsetFeatures
    {
        nonManifoldEdges        no;
        openEdges               no;
    }
}

// ************************************************************************* //
