v2206/atmospheric_AloisLuggerPlatz/meshTest/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
runApplication blockMesh
touch platz.foam

# SHM for 3D model
runApplication surfaceFeatureExtract
runApplication decomposePar -force
runParallel snappyHexMesh -overwrite
runApplication reconstructParMesh -constant
rm -r proc*
rm -r log.decom*
rm -r log.recon*

# runApplication $(getApplication)

runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

rm -rf proc*


#------------------------------------------------------------------------------
